 /*var message;
  message = "Helo";
 console.log(message) */
 

console.log('number' + 3 + 3); //відповідь number33 - конкотинація, приведення до рядка


console.log(null + 3) // тут null це 0, приведення до числа, відповідь 3

console.log (5 && "qwerty") //повертает останне обчислене значення - у данному випадку строку 

 console.log(+'40' + +'2' + "hillel"); //+'40' та +'2' - унарний + приводить до числа 40 і 2 ,потым додавання 40 +2, потым зведення до рядка, відповідь 42hillel.

console.log('10' - 5 === 6); //правило приведення до числа + строга рівність. відповідь false, тому що 5 не допівнюе 6

console.log(true + false) // = 1,  тут true = 1, false = 0, приведення до числа

console.log('4px' - 3) //  у цьому випадку буде різниця між строкою і числом, тому Nan

console.log('4' - 3) // приведення  до числа, результат 1

console.log('6' + 3 ** 0); // конкатинація. 3зведення 3 у ступінь 0 = 1,потім приведення до рядка, тому відповідь 61.

console.log(12 / '6') //приведення до числа, ділення

console.log('10' + (5 === 6)); //Конкатинація - відподідь 10false - тому що, 5 не дорівнює 6 (строга рівність) і це буде false. '10' це рядок.   

console.log(null == '') // рівність не правильна тому false 

console.log(3 ** (9 / 3)); // ділення у дужках, потім зведення у ступінь = 27

console.log(!!'false' == !!'true') //!!'true' та !!'false'  повертає !false , а !false повертаеє  true. рівність правильна

console.log(0 || '0' && 1) // 0 це False, '0' - true, тому 0 || '0' буде true -оператор || повертає якщо хочаб один true. А  true && 1 = 1 - тому що оператор && повертае true якщо обидва true. у данному віпадку 1.

console.log((+null == false) < 1); // не вірне порівняння, +null == false буде true тому що при порывнянны приводится до числа, а true не може бути меньше 1

console.log(false && true || true) // false && true=false тому що оператор && повертае true якщо обидва true. false|| true = true - оператор || повертає якщо хочаб один true

console.log(false && (false || true)); // false || true = true - оператор || повертає якщо хочаб один true. false && true = true - тому що оператор && повертае true якщо обидва true. У данному випадку спрацьокує правило математики - спершу дія виконуеться у дужках

console.log((+null == false) < 1 ** 5); //   не вірне порівняння, +null == false буде true тому що при порывнянны приводится до числа, 1**5=1. А true не може бути меньше 1
